# Merging, Joining & Concatenating

In [1]:
# import lib
import numpy as np
import pandas as pd

In [4]:
# reading_csv
courses = pd.read_csv('courses.csv')
deliveries = pd.read_csv('deliveries.csv')
matches = pd.read_csv('matches.csv')
reg1 = pd.read_csv('reg-month1.csv')
reg2 = pd.read_csv('reg-month2.csv')
students = pd.read_csv('students.csv')

In [5]:
courses.head(1)

   course_id course_name  price
0          1      python   2499

In [6]:
deliveries.head(1)

,match_id,inning,batting_team,bowling_team,over,ball,batsman,non_striker,bowler,is_super_over,...,bye_runs,legbye_runs,noball_runs,penalty_runs,batsman_runs,extra_runs,total_runs,player_dismissed,dismissal_kind,fielder
0,1,1,Sunrisers Hyderabad,Royal Challengers Bangalore,1,1,DA Warner,S Dhawan,TS Mills,0,...,0,0,0,0,0,0,0,NaN,NaN,NaN

In [7]:
matches.head(1)

,id,season,city,date,team1,team2,toss_winner,toss_decision,result,dl_applied,winner,win_by_runs,win_by_wickets,player_of_match,venue,umpire1,umpire2,umpire3
0,1,2017,Hyderabad,2017-04-05,Sunrisers Hyderabad,Royal Challengers Bangalore,Royal Challengers Bangalore,field,normal,0,Sunrisers Hyderabad,35,0,Yuvraj Singh,"Rajiv Gandhi International Stadium, Uppal",AY Dandekar,NJ Llong,NaN

In [8]:
reg1.head(1)

   student_id  course_id
0          23          1

In [9]:
reg2.head(1)

   student_id  course_id
0           3          5

In [10]:
students.head(1)

   student_id           name  partner
0           1  Kailash Harjo       23